In [1]:
import pandas as pd
import numpy as np

# Multiindex

If you set an index to more than one columnn you are creating multi index or Hieararchical index. This makes asking questions based on indexes a lot more easier, and also opens the possibility of working with multidimensional data. 

We'll use the example sourced from [here](https://chrisalbon.com/python/pandas_hierarchical_data.html).

In [2]:
# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [3]:
df_1_ind = df.set_index('regiment')
df_1_ind

           company      name  preTestScore  postTestScore
regiment
Nighthawks     1st    Miller             4             25
Nighthawks     1st  Jacobson            24             94
Nighthawks     2nd       Ali            31             57
Nighthawks     2nd    Milner             2             62
Dragoons       1st     Cooze             3             70
Dragoons       1st     Jacon             4             25
Dragoons       2nd    Ryaner            24             94
Dragoons       2nd      Sone            31             57
Scouts         1st     Sloan             2             62
Scouts         1st     Piger             3             70
Scouts         2nd     Riani             2             62
Scouts         2nd       Ali             3             70

In [4]:
# How do we get the average scores, based on the regiment? 
df_1_ind.mean(level = 'regiment')

            preTestScore  postTestScore
regiment
Nighthawks         15.25           59.5
Dragoons           15.50           61.5
Scouts              2.50           66.0

In [5]:
# How about you want to get the mean scores, based on the company but not the regiment? 

# Set the hierarchical index to be by regiment, and then by company
df_2_ind = df.set_index(['regiment', 'company'])
df_2_ind

                        name  preTestScore  postTestScore
regiment   company
Nighthawks 1st        Miller             4             25
           1st      Jacobson            24             94
           2nd           Ali            31             57
           2nd        Milner             2             62
Dragoons   1st         Cooze             3             70
           1st         Jacon             4             25
           2nd        Ryaner            24             94
           2nd          Sone            31             57
Scouts     1st         Sloan             2             62
           1st         Piger             3             70
           2nd         Riani             2             62
           2nd           Ali             3             70

<div class="alert alert-block alert-info">
<p>
Having multiple indexes will give you an easy way to model more than two dimensional data with DataFrames, which are by default a two dimensional data structures. 
</p>
<p>
For the above example, you can imagine each regiment is a two-dimensional array giving details about the company, names and the scores, and they are stacked one below the other. 
</p>
</div>

In [8]:
df_2_ind.mean(level='company')
df_2_ind.mean(level='regiment')
df_2_ind.mean(level=['regiment','company'])

                    preTestScore  postTestScore
regiment   company
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

# Pandas Aggregation

In [9]:
# We'll be using our college scorecard dataset in this tutorial.
college_scorecard = pd.read_csv(
    './data/college-scorecard-data-scrubbed.csv', 
    encoding='latin-1')

### The `describe()` method
The `describe()` method is available on both **`Series`** and **`DataFrame`** objects and outputs a variety of aggregations that are very useful in getting the general "sense" of a dataset.

In [11]:
# You can specify **`include='all'`** to force Pandas
# to evaluate all columns.  It will inject NaN where
# a calculation cannot be done.
college_scorecard.describe()
college_scorecard.describe(include='all')

,UNITID,OPEID,OPEID6,institution_name,city,state,url,predominant_degree_code,predominant_degree_desc,institutional_owner_code,...,pell_grant_receipents,full_time_retention_rate_4_year,full_time_retention_rate_less_than_4_year,part_time_rentention_rate_4_year,part_time_rentention_rate_less_than_4_year,students_with_federal_loans,median_student_earnings,median_student_debt,less_than_4_year_school_completion_rate,4_year_school_completion_rate
count,7282.000000,7.282000e+03,7282.000000,7282,7282,7282,7225,7282.000000,7282,7282.000000,...,6966.000000,2293.000000,3843.000000,1412.000000,2208.000000,6966.000000,6201,7251,3972,2497
unique,NaN,NaN,NaN,7164,2493,59,5992,NaN,5,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,598,2059,3742,2377
top,NaN,NaN,NaN,Stevens-Henager College,New York,CA,www.itt-tech.edu,NaN,Certificate,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,PrivacySuppressed,PrivacySuppressed,PrivacySuppressed,PrivacySuppressed
freq,NaN,NaN,NaN,7,87,708,143,NaN,3343,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,816,1519,166,116
mean,283704.088300,1.911246e+06,16393.400439,NaN,NaN,NaN,NaN,1.903735,NaN,2.196924,...,0.532093,0.707081,0.686155,0.455639,0.564679,0.523092,NaN,NaN,NaN,NaN
std,133558.728309,3.459461e+06,13945.231754,NaN,NaN,NaN,NaN,0.954501,NaN,0.838866,...,0.225941,0.195645,0.180121,0.293325,0.263540,0.284088,NaN,NaN,NaN,NaN
min,100654.000000,1.002000e+05,1002.000000,NaN,NaN,NaN,NaN,0.000000,NaN,1.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN
25%,170749.500000,3.459500e+05,3459.500000,NaN,NaN,NaN,NaN,1.000000,NaN,1.000000,...,0.358850,0.618200,0.567900,0.250000,0.382925,0.333300,NaN,NaN,NaN,NaN
50%,222372.500000,1.063250e+06,10490.000000,NaN,NaN,NaN,NaN,2.000000,NaN,2.000000,...,0.523300,0.741400,0.690600,0.450000,0.503250,0.584900,NaN,NaN,NaN,NaN
75%,442070.750000,3.010606e+06,26089.750000,NaN,NaN,NaN,NaN,3.000000,NaN,3.000000,...,0.714300,0.833300,0.815750,0.636400,0.789500,0.747325,NaN,NaN,NaN,NaN
max,485458.000000,8.209882e+07,42371.000000,NaN,NaN,NaN,NaN,4.000000,NaN,3.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,NaN,NaN,NaN,NaN

## Airline Data

We will using a sample dataset of the flight schedules data that is available on Kaggle [here](https://www.kaggle.com/usdot/flight-delays)

This is only a sample of the original data. You will use the original data in your Group Project!

In [13]:
flights = pd.read_csv('./data/flight_sample.csv')
flights.sample(10)
flights.describe(include="all")

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
count,10000.0,10000.00000,10000.000000,10000.000000,10000,10000.000000,9829.000000,9834.000000,10000.000000
unique,NaN,NaN,NaN,NaN,14,NaN,NaN,NaN,NaN
top,NaN,NaN,NaN,NaN,WN,NaN,NaN,NaN,NaN
freq,NaN,NaN,NaN,NaN,2188,NaN,NaN,NaN,NaN
mean,2015.0,6.49770,15.730900,3.934900,NaN,2196.917500,7.450911,15.923429,824.911700
std,0.0,3.42207,8.743668,1.980468,NaN,1778.808251,5.399030,8.640529,604.715934
min,2015.0,1.00000,1.000000,1.000000,NaN,1.000000,1.000000,1.000000,31.000000
25%,2015.0,4.00000,8.000000,2.000000,NaN,718.750000,4.000000,11.000000,375.750000
50%,2015.0,6.00000,16.000000,4.000000,NaN,1696.500000,6.000000,14.000000,651.000000
75%,2015.0,9.00000,23.000000,6.000000,NaN,3273.000000,9.000000,18.000000,1065.000000
max,2015.0,12.00000,31.000000,7.000000,NaN,7432.000000,87.000000,167.000000,4962.000000

## Activity


### Selection Without using GroupBy

**NOTE**: The following three questions does not involve any `groupby`

1. Returning to the `flights` dataframe, extract only the flight details of the American Airlines (AA) using a mask. 
2. What is the median DISTANCE, TAXI_IN times and TAXI_OUT times? 
3. How about median DISTANCE, TAXI_IN and TAXI_OUT times for United Airlines (UA)?

In [19]:
# Question 1
aa_flights = flights[ flights['AIRLINE'] == 'AA' ]
aa_flights[['DISTANCE', 'TAXI_IN', 'TAXI_OUT']][:5]

    DISTANCE  TAXI_IN  TAXI_OUT
2        761     13.0      25.0
19       432      9.0      17.0
43      2585      8.0      20.0
55       507     14.0      10.0
59      1192      4.0      12.0

In [21]:
# Question 2
aa_flights[['DISTANCE', 'TAXI_IN', 'TAXI_OUT']].median()

DISTANCE    985.0
TAXI_IN       7.0
TAXI_OUT     15.0
dtype: float64

In [23]:
# Question 3
ua_flights = flights[ flights['AIRLINE'] == 'UA' ]
ua_flights[['DISTANCE', 'TAXI_IN', 'TAXI_OUT']][:5]
ua_flights[['DISTANCE', 'TAXI_IN', 'TAXI_OUT']].median()

DISTANCE    1023.0
TAXI_IN        7.0
TAXI_OUT      15.0
dtype: float64

# Pandas Grouping

## The `groupby()` Method

So far, all the calculations that we've done on **`DataFrame`** objects have looked at the values of columns as a whole.

The `groupby()` method allows you to move into deeper forms analysis by splitting up the rows of a dataset into groups by the values in specified row(s). You can think of this in some ways as putting rows into buckets for evaluation.

### Specifying how to Split your Dataset into Groups
Of course, before we can perform evaluations on groups, we have to create them from an existing dataframe. 

Let's explore how **`groupby()`** provides a variety of ways to split up your datasets. We'll explore some of these here, starting with the most simple.

#### Single Column Grouping

In [29]:
flights_by_airline = flights.groupby(['AIRLINE'])
# print(flights_by_airline.groups)
flights_by_airline.head( )

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
0,2015,8,19,3,EV,3260,7.0,20.0,1091
1,2015,9,23,3,WN,3050,4.0,9.0,837
2,2015,10,16,5,AA,1382,13.0,25.0,761
3,2015,1,19,1,WN,4274,5.0,23.0,1547
4,2015,4,22,3,WN,2237,5.0,18.0,872
...,...,...,...,...,...,...,...,...,...
241,2015,10,23,5,NK,305,6.0,14.0,2173
270,2015,11,23,1,VX,108,7.0,8.0,2288
299,2015,3,25,3,NK,501,6.0,10.0,1139
329,2015,6,18,4,NK,180,8.0,12.0,1076
331,2015,9,4,5,NK,141,13.0,19.0,2329

The **`groupby()`** method returns an type called **`DataFrameGroupBy`**. We will explore it in more depth shortly, but for now just know that it has an attribute called **`groups`** which provides a *`dict`* object with the **labels** of each group and the **corresponding index values** in the original dataframe that belong to that group.

If you look above, you can see there is a group labelled 'AA' will index values [2,   19,   43,   55,   59,   64,   71,   74,   82,   92, ...].

You can think of this as a record of all the groups that we will perform calculations on later.

#### Multi Column Grouping

You can specify multiple columns if you wish to split your data up in multiple levels:

In [30]:
flights_by_airline_month = flights.groupby(['AIRLINE', 'MONTH'])
flights_by_airline_month.groups

{('AA',
  1): Int64Index([ 182,  476,  573,  641,  655,  722,  848,  914,  971, 1027, 1266,
             1836, 1889, 1892, 2024, 2060, 2062, 2188, 2207, 2240, 2409, 2454,
             2512, 2652, 2737, 2895, 2933, 2958, 2978, 3039, 3542, 3562, 3635,
             3808, 4031, 4130, 4193, 4245, 4318, 4435, 4540, 4623, 4631, 4800,
             4914, 4955, 5199, 5239, 5402, 5417, 5453, 5773, 5853, 5870, 5893,
             5963, 6028, 6149, 6345, 6395, 6736, 6800, 6997, 7051, 7229, 7239,
             7380, 7434, 7717, 7791, 7862, 7875, 7879, 8015, 8205, 8217, 8233,
             8243, 8280, 8329, 8497, 8742, 8779, 8872, 9152, 9236, 9294, 9571],
            dtype='int64'),
 ('AA',
  2): Int64Index([ 512,  571,  616,  727,  860,  929,  953,  956, 1086, 1118, 1159,
             1231, 1291, 1456, 1512, 1734, 1796, 1910, 1940, 1941, 1959, 2090,
             2430, 2589, 2962, 3257, 3358, 3369, 3629, 3760, 3851, 4019, 4060,
             4078, 4155, 4319, 4508, 4520, 4575, 4829, 5759, 5924, 6170, 6215,
             6350, 6488, 6645, 6684, 6817, 7392, 7414, 7673, 7683, 7686, 7868,
             7927, 7996, 8102, 8135, 8164, 8209, 8398, 8719, 8751, 8970, 9073,
             9178, 9336, 9378, 9460, 9647, 9715, 9787, 9794],
            dtype='int64'),
 ('AA',
  3): Int64Index([  19,  384,  401,  581,  777,  821,  959, 1366, 1367, 1669, 1780,
             1806, 1812, 1840, 1925, 1932, 2011, 2013, 2177, 2241, 2440, 2483,
             2579, 2893, 2947, 2969, 3047, 3128, 3324, 3600, 3653, 3730, 3869,
             4076, 4121, 4267, 4359, 4408, 4556, 5135, 5232, 5286, 5315, 5427,
             5525, 5610, 5615, 5725, 5844, 6269, 6483, 6558, 6682, 6690, 6926,
             7057, 7230, 7258, 7265, 7282, 7308, 7364, 7488, 7519, 7697, 7802,
             7848, 7998, 8050, 8127, 8161, 8208, 8556, 8628, 8824, 8848, 8852,
             8922, 8926, 8977, 9173, 9284, 9327, 9545, 9587, 9767, 9791, 9871,
             9893],
            dtype='int64'),
 ('AA',
  4): Int64Index([  92,  186,  268,  289,  351,  545,  574,  593,  618,  705, 1070,
             1221, 1257, 1294, 1327, 1689, 1750, 2118, 2166, 2202, 2338, 2392,
             2408, 2447, 2799, 3155, 3261, 3284, 3509, 3512, 3744, 3757, 3818,
             3900, 3948, 3968, 4327, 4349, 4369, 4389, 4497, 4531, 4591, 4990,
             5000, 5422, 5511, 5635, 5680, 5757, 6158, 6335, 6453, 6667, 6759,
             6813, 6820, 7047, 7098, 7149, 7397, 7444, 7446, 7467, 7551, 7599,
             8038, 8110, 8143, 8179, 8515, 8559, 8893, 8966, 9014, 9103, 9304,
             9472, 9646, 9660, 9668, 9731, 9734, 9816, 9902, 9932, 9943],
            dtype='int64'),
 ('AA',
  5): Int64Index([ 179,  295,  387,  542,  847,  856,  889, 1127, 1165, 1190, 1349,
             1601, 1685, 1811, 1863, 2034, 2555, 2669, 3046, 3093, 3119, 3144,
             3190, 3198, 3318, 3378, 3593, 3612, 3672, 3684, 3889, 3915, 4010,
             4177, 4394, 4411, 4483, 4525, 4596, 4636, 4676, 4718, 4792, 4808,
             4849, 5040, 5209, 5217, 5311, 5361, 5389, 5436, 5647, 5833, 5969,
             6066, 6181, 6229, 6578, 6766, 6857, 6883, 6915, 6928, 7156, 7472,
             7772, 7826, 7896, 8298, 8408, 8763, 8829, 8856, 8928, 9434, 9519,
             9610, 9809, 9953],
            dtype='int64'),
 ('AA',
  6): Int64Index([  43,  254,  363,  497,  767, 1006, 1121, 1280, 1388, 1674, 1696,
             1772, 1833, 1887, 2079, 2150, 2276, 2326, 2339, 2488, 2572, 2635,
             2856, 2890, 2900, 3317, 3575, 3779, 3953, 4089, 4215, 4352, 4841,
             4918, 5095, 5713, 5737, 5916, 6146, 6196, 6339, 6444, 6749, 7161,
             7279, 7571, 7584, 7676, 7736, 7894, 8194, 8235, 8268, 8420, 8461,
             8547, 8791, 8883, 9122, 9184, 9483, 9643],
            dtype='int64'),
 ('AA',
  7): Int64Index([ 100,  156,  310,  352,  426,  475,  644,  662,  825,  940,
             ...
             9190, 9321, 9452, 9572, 9679, 9739, 9782, 9936, 9975, 9989],
            dtype='int64', length=116),
 ('AA',
  8): Int64Index([ 141,  215,  376,  458,  511,  683,  715,  736,  791, 1051,
             ...
             9388, 9625, 9665, 9725, 9801, 9803, 9810, 9894, 9922, 9998],
            dtype='int64', length=129),
 ('AA',
  9): Int64Index([  71,  139,  222,  362,  417,  433,  873,  880,  882,  892,
             ...
             9186, 9228, 9259, 9379, 9389, 9450, 9589, 9600, 9613, 9763],
            dtype='int64', length=123),
 ('AA',
  10): Int64Index([   2,   55,   74,  298,  414,  443,  502,  505,  518,  570,
             ...
             9040, 9046, 9213, 9267, 9328, 9605, 9696, 9858, 9889, 9924],
            dtype='int64', length=119),
 ('AA',
  11): Int64Index([  64,   82,  171,  361,  612,  751,  779,  820,  836,  894,
             ...
             9495, 9500, 9504, 9641, 9642, 9671, 9735, 9883, 9904, 9942],
            dtype='int64', length=121),
 ('AA',
  12): Int64Index([  59,  134,  160,  307,  445,  635,  782,  826,  918,  957,
             ...
             9273, 9300, 9358, 9426, 9465, 9480, 9578, 9703, 9747, 9971],
            dtype='int64', length=128),
 ('AS',
  1): Int64Index([  95, 1171, 1571, 1598, 1801, 1821, 2212, 2884, 3292, 3321, 3451,
             3863, 4004, 4169, 4284, 5029, 5831, 7241, 7822, 8862, 8963, 9095,
             9349],
            dtype='int64'),
 ('AS',
  2): Int64Index([ 535,  853, 1105, 2219, 3006, 3120, 3291, 3379, 4377, 4730, 4908,
             5154, 5339, 5382, 5533, 5763, 6340, 7738, 7898, 8076, 8417, 8471,
             8511, 8844, 8850, 9174, 9742],
            dtype='int64'),
 ('AS',
  3): Int64Index([1272, 2418, 3398, 3431, 4774, 5061, 5108, 5179, 6172, 6337, 7270,
             7415, 7672, 8996, 9534, 9673, 9991],
            dtype='int64'),
 ('AS',
  4): Int64Index([ 749, 1646, 1904, 2393, 2964, 3417, 3696, 4202, 4494, 4510, 5299,
             5710, 5875, 6227, 7188, 7260, 7543, 7804, 7809, 8317, 8337, 8445,
             8737, 9365, 9422],
            dtype='int64'),
 ('AS',
  5): Int64Index([ 127,  343,  560,  741,  744,  845, 1043, 1074, 2139, 2332, 3603,
             3692, 4170, 4423, 4959, 5163, 5244, 5262, 5367, 5416, 5536, 6216,
             6259, 6727, 6898, 7121, 7759, 8065, 8169, 8643, 8765, 9202, 9396,
             9533],
            dtype='int64'),
 ('AS',
  6): Int64Index([ 313,  598, 1346, 1437, 1500, 1943, 1984, 2554, 2676, 3308, 3322,
             3561, 3631, 3689, 5263, 5654, 5965, 6359, 6819, 7704, 8387, 8738,
             9066, 9197],
            dtype='int64'),
 ('AS',
  7): Int64Index([ 377,  470,  774,  792, 1313, 1800, 2023, 2814, 2854, 3059, 3449,
             3570, 3993, 4362, 4363, 4509, 4680, 5473, 5742, 5839, 6022, 6199,
             6507, 6530, 6739, 6969, 7076, 7095, 7146, 9192],
            dtype='int64'),
 ('AS',
  8): Int64Index([  27,   79,  167,  180,  547,  938, 1377, 1528, 1722, 2216, 2748,
             2849, 3050, 3787, 3944, 4045, 4194, 4947, 5260, 5359, 5579, 5974,
             6313, 6358, 7228, 7515, 8173, 8238, 8274, 8585, 8699, 8832, 9280,
             9933],
            dtype='int64'),
 ('AS',
  9): Int64Index([ 679,  893, 1187, 1526, 1783, 1785, 1902, 2461, 3203, 3946, 4198,
             4259, 4630, 5201, 5363, 5486, 5626, 5811, 6131, 6691, 6916, 7013,
             7170, 7200, 7910, 9390, 9732],
            dtype='int64'),
 ('AS',
  10): Int64Index([  26,  181, 1172, 1543, 1599, 2511, 4956, 5048, 5157, 5776, 5809,
             6531, 7063, 8246, 8430, 9137, 9147, 9395, 9467, 9515, 9878],
            dtype='int64'),
 ('AS',
  11): Int64Index([  18,  383,  636, 1137, 1324, 2468, 2821, 3873, 4054, 4063, 4501,
             4542, 5146, 6228, 6310, 6614, 7000, 7659, 8149, 8299, 8485, 9109,
             9650],
            dtype='int64'),
 ('AS',
  12): Int64Index([ 147,  207,  333, 1245, 1345, 2259, 3668, 4443, 4496, 5145, 5242,
             5326, 5642, 5797, 6599, 6649, 7001, 7275, 7363, 7544, 8427, 8441,
             9181, 9453, 9482, 9968],
            dtype='int64'),
 ('B6',
  1): Int64Index([  44,   87,  647,  747, 1061, 1667, 1692, 2073, 2101, 2243, 2917,
             3065, 3437, 3477, 3726, 4088, 4105, 4145, 4989, 5123, 5955, 6326,
             6447, 6900, 7037, 7209, 8162, 8332, 8662, 9262, 9456, 9683],
            dtype='int64'),
 ('B6',
  2): Int64Index([  61,  682,  699,  829, 1633, 1799, 1835, 1905, 1964, 2449, 2499,
             2656, 3373, 3648, 3682, 3741, 4043, 4138, 4611, 4613, 4823, 4924,
             6348, 6473, 6568, 6601, 6602, 6692, 6707, 6961, 7044, 7351, 7459,
             7919, 8696, 9047, 9120, 9407, 9503, 9508, 9556, 9676],
            dtype='int64'),
 ('B6',
  3): Int64Index([ 368, 1208, 1237, 2137, 2412, 2581, 2690, 2882, 3042, 3439, 3545,
             4290, 4299, 4740, 4926, 5390, 5634, 6242, 6456, 6688, 7749, 7766,
             7987, 8060, 8172, 8198, 8328, 8447, 8518, 8610, 8741, 8873, 9272,
             9468, 9636, 9661, 9797],
            dtype='int64'),
 ('B6',
  4): Int64Index([ 365,  452,  913,  930, 1232, 2059, 2104, 2267, 2292, 2399, 2704,
             3479, 3480, 3707, 4186, 5662, 5891, 6442, 7064, 8151, 8601, 8685,
             9182, 9548, 9766, 9849, 9853, 9955],
            dtype='int64'),
 ('B6',
  5): Int64Index([ 265,  385,  551,  841,  843, 1558, 1915, 2007, 2984, 3463, 3616,
             3728, 3911, 3938, 4057, 4168, 4634, 4889, 5034, 5177, 5572, 5714,
             6407, 6513, 6542, 6668, 6677, 6910, 6938, 7195, 8222, 8487, 8613,
             8695, 8787, 8967, 9509, 9840],
            dtype='int64'),
 ('B6',
  6): Int64Index([ 144,  173,  213, 1351, 1361, 1462, 1850, 2324, 2463, 2927, 3418,
             3465, 3912, 4239, 4390, 4436, 4560, 4682, 4748, 5438, 5556, 5593,
             5799, 5865, 5899, 6237, 6336, 6361, 6788, 6882, 6988, 7083, 7748,
             7979, 8254, 8392, 8590, 8949, 9250, 9354, 9372, 9714, 9885, 9903],
            dtype='int64'),
 ('B6',
  7): Int64Index([  20,  111,  151,  170,  185,  217,  341,  344,  393,  976,  984,
             1139, 1202, 1501, 2494, 2544, 2787, 2862, 2913, 3038, 3365, 4601,
             4701, 4864, 5253, 6342, 7535, 7536, 7754, 7931, 8191, 8212, 8706,
             9000, 9246, 9527, 9675],
            dtype='int64'),
 ('B6',
  8): Int64Index([ 189, 1039, 1193, 1482, 1871, 1923, 2220, 2919, 2949, 2963, 3101,
             4163, 4415, 4432, 5028, 5187, 5271, 5681, 6209, 6429, 6508, 7398,
             7701, 7905, 8181, 8322, 8363, 8730, 8913, 9218, 9969],
            dtype='int64'),
 ('B6',
  9): Int64Index([  23,  370, 1112, 1254, 1480, 2103, 2110, 2210, 2237, 2692, 2901,
             2924, 3004, 3073, 3399, 3421, 3607, 3674, 4196, 4316, 4357, 4387,
             4640, 4999, 5097, 5418, 5483, 5749, 6183, 6294, 6740, 7358, 7590,
             7857, 7877, 8052, 8245, 8596, 9303, 9815],
            dtype='int64'),
 ('B6',
  10): Int64Index([ 209,  296,  585, 1089, 1132, 1918, 2189, 2850, 2907, 2982, 3375,
             3411, 3413, 3536, 3621, 3645, 3891, 3919, 4434, 4583, 5008, 5010,
             5228, 5537, 6078, 6392, 6410, 6524, 6696, 6934, 7078, 7386, 7464,
             7915, 7936, 8085, 8684, 9136, 9440, 9592],
            dtype='int64'),
 ('B6',
  11): Int64Index([  51,  428,  675,  986, 1166, 1239, 1440, 1567, 1711, 1847, 2194,
             2498, 2968, 3202, 3208, 3393, 3733, 3769, 4034, 4287, 5517, 6576,
             6908, 7235, 7327, 7483, 8124, 8285, 8533, 8793, 8945, 8971, 9065,
             9514, 9522, 9630, 9687, 9820],
            dtype='int64'),
 ('B6',
  12): Int64Index([ 231,  263,  500,  530,  576,  840, 1177, 1199, 1297, 1583, 1819,
             2061, 2129, 2304, 2578, 2955, 3035, 3539, 3565, 4071, 4337, 4581,
             5025, 5118, 5566, 6093, 6384, 6529, 6538, 6770, 6835, 6937, 6942,
             7119, 7564, 8123, 8448, 8488, 8897, 9191, 9208, 9470, 9784],
            dtype='int64'),
 ('DL',
  1): Int64Index([  99,  286,  519,  590,  591,  879,  909, 1092, 1350, 1478,
             ...
             8938, 9080, 9153, 9180, 9278, 9295, 9313, 9562, 9624, 9928],
            dtype='int64', length=104),
 ('DL',
  2): Int64Index([  39,   67,  113,  154,  220,  274,  292,  435,  438,  615,
             ...
             9003, 9039, 9201, 9402, 9406, 9418, 9513, 9711, 9741, 9996],
            dtype='int64', length=113),
 ('DL',
  3): Int64Index([ 148,  153,  312,  322,  374,  480,  548,  672,  723,  733,
             ...
             8973, 9209, 9254, 9302, 9415, 9431, 9436, 9437, 9566, 9988],
            dtype='int64', length=132),
 ('DL',
  4): Int64Index([  14,  145,  206,  244,  316,  514,  540,  700, 1019, 1034,
             ...
             9287, 9306, 9312, 9370, 9414, 9423, 9594, 9595, 9652, 9855],
            dtype='int64', length=130),
 ('DL',
  5): Int64Index([ 123,  258,  389,  394,  496,  559,  661,  703,  814,  963,
             ...
             9359, 9443, 9666, 9702, 9788, 9812, 9824, 9866, 9915, 9984],
            dtype='int64', length=134),
 ('DL',
  6): Int64Index([  47,   72,   85,  158,  159,  228,  336,  386,  410,  561,
             ...
             9125, 9149, 9277, 9350, 9421, 9550, 9561, 9689, 9863, 9938],
            dtype='int64', length=139),
 ('DL',
  7): Int64Index([ 119,  137,  233,  381,  415,  508,  538,  707,  717,  854,
             ...
             8798, 8964, 9051, 9144, 9220, 9291, 9383, 9432, 9726, 9833],
            dtype='int64', length=133),
 ('DL',
  8): Int64Index([  33,  402,  714,  725,  734,  783,  862, 1119, 1256, 1564,
             ...
             9590, 9619, 9627, 9632, 9705, 9779, 9805, 9844, 9927, 9952],
            dtype='int64', length=136),
 ('DL',
  9): Int64Index([  40,  232,  248,  323,  412,  413,  416,  525,  689,  724,
             ...
             9124, 9170, 9252, 9397, 9510, 9582, 9708, 9789, 9908, 9937],
            dtype='int64', length=123),
 ('DL',
  10): Int64Index([  80,   90,   91,  277,  360,  378,  391,  444,  446,  471,
             ...
             8836, 8976, 8995, 9175, 9214, 9409, 9457, 9785, 9837, 9923],
            dtype='int64', length=148),
 ('DL',
  11): Int64Index([  22,  192,  382,  481,  491,  584,  624,  643, 1103, 1325,
             ...
             9554, 9700, 9754, 9758, 9770, 9814, 9821, 9865, 9873, 9956],
            dtype='int64', length=123),
 ('DL',
  12): Int64Index([  77,  138,  165,  172,  253,  256,  522,  536,  558,  902,
             ...
             9366, 9521, 9575, 9591, 9691, 9738, 9740, 9769, 9845, 9877],
            dtype='int64', length=103),
 ('EV',
  1): Int64Index([  69,  557,  695,  977, 1284, 1505, 1566, 1623, 1648, 1853, 2001,
             2014, 2275, 2291, 2350, 2370, 2406, 2648, 2671, 2673, 2765, 3013,
             3099, 3216, 3270, 3347, 3978, 4023, 4153, 4538, 4726, 4762, 4949,
             5024, 5038, 5170, 5501, 5677, 5983, 5988, 6015, 6152, 6352, 6377,
             6633, 6721, 6851, 6949, 7198, 7399, 7440, 7452, 7511, 7587, 7636,
             7715, 7830, 8286, 8310, 8380, 8403, 8475, 8567, 8780, 8937, 9289,
             9347, 9360, 9377, 9597, 9817, 9946, 9986],
            dtype='int64'),
 ('EV',
  2): Int64Index([ 109,  324,  369,  398,  423,  533,  684,  807, 1523, 1664, 1683,
             1758, 1858, 1896, 1963, 2075, 2214, 2369, 2500, 2526, 2638, 2724,
             2804, 2833, 2866, 3056, 3071, 3282, 3499, 3606, 4109, 4117, 4125,
             4212, 4247, 4268, 4438, 4786, 4844, 5189, 5329, 5502, 5617, 5668,
             5786, 5787, 5837, 5946, 6095, 6119, 6761, 7020, 7232, 7367, 7447,
             7555, 7954, 8046, 8463, 8652, 8668, 8739, 8770, 8792, 8909, 8914,
             9012, 9075, 9102, 9110, 9505, 9706, 9901, 9972, 9992],
            dtype='int64'),
 ('EV',
  3): Int64Index([  88,  129,  546,  706, 1035, 1085, 1249, 1262, 1277, 1357, 1406,
             1551, 1640, 1691, 1845, 2221, 2266, 2273, 2467, 2571, 2610, 2641,
             2782, 3178, 3247, 3252, 3496, 3524, 3584, 3592, 3623, 3718, 3846,
             4107, 4410, 4653, 4657, 4857, 5159, 5184, 5303, 5336, 5515, 5618,
             5746, 5756, 5766, 5880, 6165, 6185, 6533, 6595, 6598, 6763, 6829,
             7226, 7319, 7330, 7340, 7406, 7503, 7554, 7695, 7705, 7845, 7885,
             7941, 8036, 8087, 8119, 8275, 8443, 8467, 8527, 8529, 8542, 8548,
             8580, 8692, 8694, 8728, 8974, 8980, 8994, 9031, 9084, 9159, 9553,
             9857, 9876],
            dtype='int64'),
 ('EV',
  4): Int64Index([  94,  202,  278,  326,  468,  472,  652,  740,  762,  800,
             ...
             8747, 8773, 8901, 9096, 9166, 9293, 9481, 9558, 9629, 9808],
            dtype='int64', length=106),
 ('EV',
  5): Int64Index([  42,   57,  193,  349,  397,  436,  478,  523,  532,  745, 1024,
             1141, 1343, 1359, 1489, 2071, 2145, 2394, 2575, 2622, 2695, 2808,
             2834, 2928, 2946, 3037, 3110, 3127, 3220, 3227, 3258, 3313, 3447,
             3466, 3490, 3731, 3838, 3843, 4233, 4486, 4516, 5004, 5013, 5027,
             5139, 5164, 5171, 5530, 5912, 6092, 6122, 6391, 6496, 6581, 6655,
             6796, 6865, 6950, 7097, 7099, 7154, 7183, 7443, 7542, 7711, 7746,
             8231, 8352, 8354, 8502, 8521, 8690, 9128, 9163, 9451, 9485, 9524,
             9576, 9618, 9633, 9716, 9912],
            dtype='int64'),
 ('EV',
  6): Int64Index([   5,   12,  104,  106,  143,  290,  431,  493,  556,  563,
             ...
             9297, 9362, 9382, 9404, 9502, 9694, 9755, 9764, 9852, 9888],
            dtype='int64', length=102),
 ('EV',
  7): Int64Index([ 359,  405,  447,  543,  721,  759,  837, 1106, 1120, 1143, 1490,
             1642, 1684, 1803, 2235, 2436, 2540, 2601, 2658, 2796, 2832, 2944,
             3272, 3407, 3434, 3568, 3611, 4029, 4047, 4144, 4393, 4695, 4894,
             5275, 5356, 5369, 5384, 5450, 5493, 5500, 5503, 5623, 5691, 5717,
             5866, 5871, 6080, 6140, 6193, 6211, 6212, 6380, 6450, 6673, 6832,
             6866, 7075, 7525, 7573, 7692, 8016, 8017, 8103, 8125, 8244, 8350,
             8366, 8508, 8707, 8723, 8784, 8975, 9256, 9573, 9699],
            dtype='int64'),
 ('EV',
  8): Int64Index([   0,  103,  116,  554,  609,  755,  859, 1285, 1392, 1513, 1607,
             1608, 1609, 1693, 1744, 2284, 2290, 2342, 2353, 2485, 2508, 2566,
             2630, 2871, 3090, 3106, 3186, 3461, 3544, 3698, 3719, 3974, 4087,
             4148, 4476, 4519, 4578, 4668, 4669, 4733, 4803, 4840, 4909, 5280,
             5351, 5399, 5413, 5774, 6085, 6104, 6232, 6286, 6463, 6470, 6494,
             6589, 6681, 6710, 6750, 6774, 7024, 7066, 7366, 7409, 7492, 7596,
             7604, 7807, 7884, 8234, 8239, 8296, 8365, 8388, 8419, 8435, 8468,
             8620, 8865, 9041, 9237, 9492, 9511, 9672, 9783, 9800, 9993],
            dtype='int64'),
 ('EV',
  9): Int64Index([  13,  380,  441,  474,  544,  633,  665,  698, 1005, 1050, 1188,
             1213, 1315, 1427, 1574, 1671, 1737, 1777, 1808, 1843, 1855, 1877,
             2146, 2156, 2191, 2209, 2316, 2548, 3147, 3189, 3297, 3445, 3585,
             3768, 3973, 3992, 3994, 3996, 3999, 4103, 4643, 5032, 5104, 5240,
             5270, 5584, 5595, 5694, 5770, 6039, 6206, 6262, 6486, 6541, 6683,
             6752, 6785, 6809, 6935, 7145, 7249, 7273, 7582, 7662, 7881, 8009,
             8223, 8458, 8606, 8881, 8950, 9085, 9167, 9211, 9238, 9611],
            dtype='int64'),
 ('EV',
  10): Int64Index([  96,  273,  317,  325,  424,  516,  686,  898, 1014, 1229, 1251,
             1336, 1338, 1487, 1587, 1600, 1621, 1787, 2169, 2472, 2619, 2675,
             2678, 2770, 2864, 2999, 3020, 3075, 3077, 3136, 3141, 3153, 3193,
             3296, 3320, 3357, 3368, 3469, 3586, 3664, 3738, 3770, 3805, 3904,
             4118, 4179, 4293, 4469, 4618, 4709, 4821, 4900, 4913, 5220, 5227,
             5310, 5396, 5508, 5640, 5972, 6002, 6184, 6200, 6203, 6322, 6331,
             6413, 6422, 6515, 6811, 6993, 7077, 7313, 7566, 7579, 7713, 7870,
             8158, 8180, 8232, 8507, 8616, 8639, 8756, 9059, 9097, 9322, 9476,
             9552, 9663],
            dtype='int64'),
 ('EV',
  11): Int64Index([  65,  102,  276,  392,  904, 1000, 1037, 1224, 1539, 1614, 1617,
             1814, 1974, 2012, 2040, 2053, 2204, 2294, 2315, 2341, 2623, 2708,
             2803, 2952, 3058, 3109, 3179, 3647, 3727, 4022, 4037, 4046, 4053,

### Aggregations after GroupBy

For example, let us say you want to find out the average distance traveled by each airline, you can do that using the following aggregeate function

In [31]:
flights.head()

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
0,2015,8,19,3,EV,3260,7.0,20.0,1091
1,2015,9,23,3,WN,3050,4.0,9.0,837
2,2015,10,16,5,AA,1382,13.0,25.0,761
3,2015,1,19,1,WN,4274,5.0,23.0,1547
4,2015,4,22,3,WN,2237,5.0,18.0,872

In [32]:
flights_by_airline = flights.groupby(['AIRLINE'])

In [33]:
flights_by_airline.mean()

,YEAR,MONTH,DAY,DAY_OF_WEEK,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
AIRLINE,,,,,,,,
AA,2015.0,7.097862,16.024671,4.055921,1266.090461,9.092593,17.785354,1053.736842
AS,2015.0,6.565916,15.356913,3.996785,386.385852,6.443730,15.073955,1202.405145
B6,2015.0,6.653333,15.771111,3.893333,905.420000,5.966216,18.231982,1064.124444
DL,2015.0,6.551383,15.486825,3.887352,1631.198287,7.279392,17.189564,862.416996
EV,2015.0,6.408591,15.355644,3.851149,4742.821179,7.700409,16.813456,466.038961
F9,2015.0,7.181818,15.762238,3.790210,775.594406,10.188811,16.335664,1034.223776
HA,2015.0,6.239669,16.140496,3.809917,209.578512,7.214876,11.115702,789.768595
MQ,2015.0,6.247059,14.858824,3.917647,3304.494118,8.512397,16.628099,433.701961
NK,2015.0,6.706161,15.938389,3.976303,534.971564,8.908213,14.318841,993.298578
OO,2015.0,6.347614,16.034080,3.938656,5193.527751,6.725919,17.864945,516.424537
UA,2015.0,6.505593,15.480984,3.947427,1062.827740,8.638225,16.754545,1243.796421
US,2015.0,3.463333,15.883333,3.883333,1300.463333,7.872414,18.600000,952.810000
VX,2015.0,7.445455,15.309091,3.572727,568.563636,7.587156,14.917431,1418.900000
WN,2015.0,6.569470,16.072212,3.973492,1831.462066,6.247911,11.931787,722.505027

In [34]:
avg_by_airline = flights_by_airline[['DISTANCE', 'TAXI_OUT', 'TAXI_IN']].mean()

**NOTE**: The double [[ ]] for computing the summary stististics. The first pair [] is used to look into the `DataFrameGroupyBy` object the second pair [] is used to list all the columns you want to produce the summary statistics.

In [35]:
avg_by_airline

            DISTANCE   TAXI_OUT    TAXI_IN
AIRLINE
AA       1053.736842  17.785354   9.092593
AS       1202.405145  15.073955   6.443730
B6       1064.124444  18.231982   5.966216
DL        862.416996  17.189564   7.279392
EV        466.038961  16.813456   7.700409
F9       1034.223776  16.335664  10.188811
HA        789.768595  11.115702   7.214876
MQ        433.701961  16.628099   8.512397
NK        993.298578  14.318841   8.908213
OO        516.424537  17.864945   6.725919
UA       1243.796421  16.754545   8.638225
US        952.810000  18.600000   7.872414
VX       1418.900000  14.917431   7.587156
WN        722.505027  11.931787   6.247911

## Using `loc[]` with group by aggregate data

A dataframe is returned with the results of your aggregate data. Therefore, everything we've learned about Pandas still apply to accessing and working with the results.

This includes the use of `loc[]` to access rows and dictionary keys to access columns

In [45]:
print(avg_by_airline.loc['AA'])
print(avg_by_airline.loc['UA'])
print(avg_by_airline.loc['WN'])

DISTANCE    1053.736842
TAXI_OUT      17.785354
TAXI_IN        9.092593
Name: AA, dtype: float64
DISTANCE    1243.796421
TAXI_OUT      16.754545
TAXI_IN        8.638225
Name: UA, dtype: float64
DISTANCE    722.505027
TAXI_OUT     11.931787
TAXI_IN       6.247911
Name: WN, dtype: float64

In [50]:
flights_by_airline_month.mean()

flights_by_airline_month.mean().loc['AA',3]

YEAR             2015.000000
DAY                17.494382
DAY_OF_WEEK         4.067416
FLIGHT_NUMBER    1137.595506
TAXI_IN             9.800000
TAXI_OUT           17.188235
DISTANCE         1087.707865
Name: (AA, 3), dtype: float64

## Activity
### Gerneralizing using GroupBy

4. Instead of doing this for each airline separately, can you do this for all airlines at a the same time using `groupby`?
5. Extract the median DISTANCE for SouthWest airlines (WN) and assign it a variable `median_distance_WN`. 
6. What is the median DISTANCE, TAXI_IN times and TAXI_OUT times per airline per month? Hint: Notice that we want to group by two different columns.
7. Extract the median TAXI_OUT for SouthWest airlines (WN) in December (12) and assign it a variable `median_distance_WN_12`.

In [68]:
# Question 4
# get median 'DISTANCE', 'TAXI_IN', 'TAXI_OUT' for all airlines
median_by_airline = flights[ 
    ['AIRLINE', 'DISTANCE', 'TAXI_IN', 'TAXI_OUT'] 
].groupby('AIRLINE').median()

median_by_airline[:3]

         DISTANCE  TAXI_IN  TAXI_OUT
AIRLINE
AA          985.0      7.0      15.0
AS          954.0      5.0      14.0
B6          997.0      5.0      15.0

In [72]:
# Question 5
# Extract the median DISTANCE for SouthWest airlines (WN) using loc[]
# Assign it a variable median_distance_WN
median_by_airline.loc['WN']['DISTANCE']

611.0

In [64]:
# Question 6
# What is the median DISTANCE, TAXI_IN times and TAXI_OUT times per airline per month? 
median_by_airline_and_month = flights[ ['AIRLINE', 'MONTH', 'DISTANCE', 'TAXI_IN', 'TAXI_OUT'] ].groupby(['AIRLINE', 'MONTH']).median()
median_by_airline_and_month[:3]

               DISTANCE  TAXI_IN  TAXI_OUT
AIRLINE MONTH
AA      1        1061.0      7.0      15.0
        2         932.5      8.0      14.0
        3        1089.0      8.0      16.0

In [67]:
# Question 7: 
# Extract the median TAXI_OUT for SouthWest airlines (WN) in December (12) 
# Assign it a variable median_distance_WN_12
median_by_airline_and_month.loc['WN', 12]['TAXI_OUT']

10.0

### Understanding the Aggregation After GroupBy: Method Dispatching

Let us now look at how the Aggregations on the DataFrameGroupBy objects work. In the **`DataFrameGroupBy`** objects, any method not found on the object itself is forwarded ("**dispatched**") to all the groups that it contains.

That is why we were able to ask for the *`median`* of a **`flights_by_airline`** object above and get something back: it is (1) "dispatching" the *`median`* method call to each group (that is each airline), (2) collecting the results and (3) presenting them to us.

In [73]:
flights_by_airline = flights.groupby(['AIRLINE'])

In [74]:
flights_by_airline.median()

,YEAR,MONTH,DAY,DAY_OF_WEEK,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
AIRLINE,,,,,,,,
AA,2015.0,8.0,16.0,4.0,1292.0,7.0,15.0,985.0
AS,2015.0,7.0,15.0,4.0,384.0,5.0,14.0,954.0
B6,2015.0,7.0,16.0,4.0,749.0,5.0,15.0,997.0
DL,2015.0,7.0,15.0,4.0,1654.5,6.0,15.0,666.0
EV,2015.0,6.0,15.0,4.0,4891.0,7.0,15.0,429.0
F9,2015.0,7.0,14.0,4.0,720.0,8.0,13.0,927.0
HA,2015.0,6.0,16.0,4.0,214.0,6.0,11.0,163.0
MQ,2015.0,6.0,14.0,4.0,3301.5,6.0,14.0,408.0
NK,2015.0,7.0,16.0,4.0,511.0,7.0,12.0,977.0
OO,2015.0,6.0,16.0,4.0,5265.0,5.0,16.0,451.0
UA,2015.0,7.0,16.0,4.0,1141.5,7.0,15.0,1023.0
US,2015.0,3.0,16.5,4.0,1717.0,6.0,16.0,705.5
VX,2015.0,8.0,14.0,3.5,490.5,7.0,12.0,1313.5
WN,2015.0,7.0,16.0,4.0,1516.0,5.0,10.0,611.0

In [76]:
# Compute the median for the entire DataFrameGroupBy object and then select 'DISTANCE' column 
flights_by_airline.median()[['DISTANCE']][:2]

         DISTANCE
AIRLINE
AA          985.0
AS          954.0

In [77]:
# Select the 'DISTANCE' Column as a dataframe and then compute the median
flights_by_airline[ ['DISTANCE'] ].median()[:2]

         DISTANCE
AIRLINE
AA          985.0
AS          954.0

In [78]:
# Select the 'DISTANCE' Column as a numpy array and then compute the median
flights_by_airline['DISTANCE'].median()[:2]

AIRLINE
AA    985.0
AS    954.0
Name: DISTANCE, dtype: float64

**Question**: Which of the above methods should be preferred?

### Methods of `DataFrameGroupBy` Objects
Now we will understand the various operations built into the `DataFrameGroupBy` object type.

#### The `aggregate()` Method
At first, the `aggregate()` method appears to be quite similiar to what we just covered when we talked about method dispatching. It performs aggregations on the groups in a **`DataFrameGroupBy`** object.

In [79]:
flights_by_airline.aggregate('mean')

,YEAR,MONTH,DAY,DAY_OF_WEEK,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
AIRLINE,,,,,,,,
AA,2015.0,7.097862,16.024671,4.055921,1266.090461,9.092593,17.785354,1053.736842
AS,2015.0,6.565916,15.356913,3.996785,386.385852,6.443730,15.073955,1202.405145
B6,2015.0,6.653333,15.771111,3.893333,905.420000,5.966216,18.231982,1064.124444
DL,2015.0,6.551383,15.486825,3.887352,1631.198287,7.279392,17.189564,862.416996
EV,2015.0,6.408591,15.355644,3.851149,4742.821179,7.700409,16.813456,466.038961
F9,2015.0,7.181818,15.762238,3.790210,775.594406,10.188811,16.335664,1034.223776
HA,2015.0,6.239669,16.140496,3.809917,209.578512,7.214876,11.115702,789.768595
MQ,2015.0,6.247059,14.858824,3.917647,3304.494118,8.512397,16.628099,433.701961
NK,2015.0,6.706161,15.938389,3.976303,534.971564,8.908213,14.318841,993.298578
OO,2015.0,6.347614,16.034080,3.938656,5193.527751,6.725919,17.864945,516.424537
UA,2015.0,6.505593,15.480984,3.947427,1062.827740,8.638225,16.754545,1243.796421
US,2015.0,3.463333,15.883333,3.883333,1300.463333,7.872414,18.600000,952.810000
VX,2015.0,7.445455,15.309091,3.572727,568.563636,7.587156,14.917431,1418.900000
WN,2015.0,6.569470,16.072212,3.973492,1831.462066,6.247911,11.931787,722.505027

The difference is that the **`aggregate()`** method gives you some additional options that are not available if you rely on method dispatching as shown above.

In [80]:
# You can pass multiple aggregates as a list.
# Here will we get various aggregates for each
# column of our flights_by_airline object.
flights_by_airline.aggregate([np.mean, 'min', 'max'])[:5]

         YEAR                 MONTH                DAY         DAY_OF_WEEK  \
         mean   min   max      mean min max       mean min max        mean
AIRLINE
AA       2015  2015  2015  7.097862   1  12  16.024671   1  31    4.055921
AS       2015  2015  2015  6.565916   1  12  15.356913   1  31    3.996785
B6       2015  2015  2015  6.653333   1  12  15.771111   1  31    3.893333
DL       2015  2015  2015  6.551383   1  12  15.486825   1  31    3.887352
EV       2015  2015  2015  6.408591   1  12  15.355644   1  31    3.851149

         ... FLIGHT_NUMBER   TAXI_IN              TAXI_OUT              \
         ...           max      mean  min   max       mean  min    max
AIRLINE  ...
AA       ...          2580  9.092593  2.0  60.0  17.785354  7.0  110.0
AS       ...           895  6.443730  2.0  24.0  15.073955  3.0   88.0
B6       ...          2784  5.966216  2.0  38.0  18.231982  7.0   81.0
DL       ...          2853  7.279392  1.0  68.0  17.189564  7.0  105.0
EV       ...          6189  7.700409  2.0  47.0  16.813456  3.0  144.0

            DISTANCE
                mean  min   max
AIRLINE
AA       1053.736842  130  3784
AS       1202.405145   31  2846
B6       1064.124444   68  2704
DL        862.416996   74  4502
EV        466.038961   69  1330

[5 rows x 24 columns]

<div class="alert alert-block alert-warning">
<p>
It is important to notice that you are able to pass both strings and functions to the `aggregate()` method. It is probably best to choose one approach and stick with it rather than mixing and matching like I've done here.
</p>
</div>

In [81]:
flights_by_airline.aggregate([np.mean, np.min, np.max]).head(5)

         YEAR                 MONTH                  DAY            \
         mean  amin  amax      mean amin amax       mean amin amax
AIRLINE
AA       2015  2015  2015  7.097862    1   12  16.024671    1   31
AS       2015  2015  2015  6.565916    1   12  15.356913    1   31
B6       2015  2015  2015  6.653333    1   12  15.771111    1   31
DL       2015  2015  2015  6.551383    1   12  15.486825    1   31
EV       2015  2015  2015  6.408591    1   12  15.355644    1   31

        DAY_OF_WEEK  ... FLIGHT_NUMBER   TAXI_IN              TAXI_OUT       \
               mean  ...          amax      mean amin  amax       mean amin
AIRLINE              ...
AA         4.055921  ...          2580  9.092593  2.0  60.0  17.785354  7.0
AS         3.996785  ...           895  6.443730  2.0  24.0  15.073955  3.0
B6         3.893333  ...          2784  5.966216  2.0  38.0  18.231982  7.0
DL         3.887352  ...          2853  7.279392  1.0  68.0  17.189564  7.0
EV         3.851149  ...          6189  7.700409  2.0  47.0  16.813456  3.0

                   DISTANCE
          amax         mean amin  amax
AIRLINE
AA       110.0  1053.736842  130  3784
AS        88.0  1202.405145   31  2846
B6        81.0  1064.124444   68  2704
DL       105.0   862.416996   74  4502
EV       144.0   466.038961   69  1330

[5 rows x 24 columns]

Your textbook also talks about using a dict to apply labels to the aggregation columns so that they can have user friendly names like 'Longest Distance' rather than just 'max'.

This sort of functionality is, however, deprecated in Pandas, which means that it will be removed in future versions.

To accomplish the same thing, we should instead append a `rename()` method after our `aggregate()` method like so:

In [82]:
# Using `rename()` to apply friendly labels to output columns
flights_by_airline[['DISTANCE','TAXI_OUT']].aggregate(
    [np.mean, np.min, np.max]).rename(
        columns={'mean': 'Avg. Distance', 
                 'amin': 'Shortest Distance', 
                 'amax': 'Longest Distance'})

             DISTANCE                                         TAXI_OUT  \
        Avg. Distance Shortest Distance Longest Distance Avg. Distance
AIRLINE
AA        1053.736842               130             3784     17.785354
AS        1202.405145                31             2846     15.073955
B6        1064.124444                68             2704     18.231982
DL         862.416996                74             4502     17.189564
EV         466.038961                69             1330     16.813456
F9        1034.223776               373             2218     16.335664
HA         789.768595                84             2917     11.115702
MQ         433.701961                89             1236     16.628099
NK         993.298578               177             2381     14.318841
OO         516.424537                67             1735     17.864945
UA        1243.796421               137             4962     16.754545
US         952.810000               130             2979     18.600000
VX        1418.900000               189             2704     14.917431
WN         722.505027               148             2447     11.931787


        Shortest Distance Longest Distance
AIRLINE
AA                    7.0            110.0
AS                    3.0             88.0
B6                    7.0             81.0
DL                    7.0            105.0
EV                    3.0            144.0
F9                    7.0             53.0
HA                    5.0             26.0
MQ                    4.0            167.0
NK                    7.0             63.0
OO                    4.0             78.0
UA                    7.0             73.0
US                    8.0            149.0
VX                    7.0             69.0
WN                    1.0             99.0

<div class="alert alert-block alert-danger">
<p>
Note, there are three main things happening in the above statement. 
<ul>
<li> flights_by_airline['DISTANCE'] selects the distance column for analysis</li>
<li> flights_by_airline['DISTANCE'].aggregate([np.mean, np.min, np.max]) computes the average, min and max of the distance column selected</li>
<li> Finally .rename() function is appropriately renaming the columns according the dictionary we have given  </li>
</ul>
</p>
</div>

The recommended way of using a **`dict`** with the **`aggregate()`** method is actually to specify which aggregation(s) to perform on what columns. You can use it to specify different aggregation(s) on a per-column basis.

Here I'll use it to get the high/low values for DISTANCE and the mean for TAXI_IN on our *`flights_by_airline_month`* object.

In [83]:
flights_by_airline_month = flights.groupby(['AIRLINE', 'MONTH'])

# Notice how using this style automatically filters
# out all columns you don't specify.
flights_by_airline_month.aggregate(
        {'DISTANCE': [np.min, np.max], 
         'TAXI_IN': np.mean}
).tail(20)

              DISTANCE         TAXI_IN
                  amin  amax      mean
AIRLINE MONTH
VX      5          414  2704  8.000000
        6          337  2586  8.000000
        7          189  2454  7.285714
        8          337  2704  7.000000
        9          236  2475  6.000000
        10         236  2475  7.294118
        11         236  2565  7.187500
        12         337  2586  7.333333
WN      1          148  2447  6.519337
        2          148  2039  5.715278
        3          223  2253  5.944751
        4          148  2335  6.071429
        5          189  2447  5.736842
        6          187  2335  6.666667
        7          187  2447  7.418848
        8          189  2329  5.937500
        9          148  2335  5.687500
        10         148  2295  6.312500
        11         187  1892  6.273196
        12         148  2106  6.395833

## Activity: 

We will work again on the `college-loan-default-rates.csv` and `college-scorecard-data-scrubbed.csv` datasets. 

Use `aggregate()` method to produce

1. The average, minimum and maximum `full_time_retention_rate_4_year` per state using `college-scorecard-data-scrubbed.csv` dataset. 
    * After producing the above summary statistics, make sure you rename your columns for average, minimum and maximum as `Avg. Retention`, `Low Retention`, and `High Retention` respectively. 
2. Produce per state and city, minimum and maximum for the `sat_average` column and average for the `full_time_retention_rate_4_year` column. 

3. Which state has the highest average four year retention rate (`full_time_retention_rate_4_year`)? Which has the lowest average?

In [2]:
import numpy as np
import pandas as pd

In [3]:
# For this tutorial, we will need both of our datasets.
college_loan_defaults = pd.read_csv(
    './data/college-loan-default-rates.csv')

college_scorecard = pd.read_csv(
    './data/college-scorecard-data-scrubbed.csv', 
    encoding='latin-1')

college_scorecard.head()

,UNITID,OPEID,OPEID6,institution_name,city,state,url,predominant_degree_code,predominant_degree_desc,institutional_owner_code,...,pell_grant_receipents,full_time_retention_rate_4_year,full_time_retention_rate_less_than_4_year,part_time_rentention_rate_4_year,part_time_rentention_rate_less_than_4_year,students_with_federal_loans,median_student_earnings,median_student_debt,less_than_4_year_school_completion_rate,4_year_school_completion_rate
0,102580,884300,8843,Alaska Bible College,Palmer,AK,www.akbible.edu/,3,Bachelors,2,...,0.3571,0.3333,NaN,NaN,NaN,0.2857,NaN,PrivacySuppressed,NaN,NaN
1,103501,2541000,25410,Alaska Career College,Anchorage,AK,www.alaskacareercollege.edu,1,Certificate,3,...,0.7078,NaN,0.7941,NaN,NaN,0.7860,28700,8994,0.707589494,NaN
2,442523,4138600,41386,Alaska Christian College,Soldotna,AK,www.alaskacc.edu,1,Certificate,2,...,0.8868,NaN,0.4737,NaN,1.0,0.6792,NaN,PrivacySuppressed,0,NaN
3,102669,106100,1061,Alaska Pacific University,Anchorage,AK,www.alaskapacific.edu,3,Bachelors,2,...,0.3152,0.7742,NaN,1.0,NaN,0.5297,47000,23250,NaN,0.514833663
4,102711,3160300,31603,AVTEC-Alaska's Institute of Technology,Seward,AK,www.avtec.edu/,1,Certificate,1,...,0.0737,NaN,1.0000,NaN,1.0,0.0664,33500,PrivacySuppressed,0.846055789,NaN

In [20]:
# Question 1
# The average, minimum and maximum full_time_retention_rate_4_year 
# per state using college-scorecard-data-scrubbed.csv dataset.
# After producing the above summary statistics, 
# make sure you rename your columns for 
# average, minimum and maximum as Avg. Retention, Low Retention, and High Retention respectively.

scorecard_by_state = college_scorecard.groupby(['state'])
summary_full_time = scorecard_by_state['full_time_retention_rate_4_year'].aggregate(
    [np.mean, np.min, np.max]
).rename( columns=
         {
            'mean': 'Average', 
            'amin': 'Minimum', 
            'amax': 'Maximum'
         }
        )
summary_full_time[:3]

        Average  Minimum  Maximum
state
AK     0.663240   0.3333   0.7756
AL     0.615436   0.0000   1.0000
AR     0.650996   0.2564   0.8667

In [15]:
# Question 2
# Produce per state and city, minimum and maximum for the sat_average column 
# and average for the full_time_retention_rate_4_year column
scorecard_by_state_city = college_scorecard.groupby(['state', 'city'])
scorecard_by_state_city.aggregate(
    {
        'sat_average': [np.min, np.max],
        'full_time_retention_rate_4_year': [np.mean]
    }
).rename( columns=
         {
            'mean': 'Average', 
            'amin': 'Minimum', 
            'amax': 'Maximum'
         }
        )

                   sat_average         full_time_retention_rate_4_year
                       Minimum Maximum                         Average
state city
AK    Anchorage         1054.0  1054.0                          0.7453
      Barrow               NaN     NaN                             NaN
      Fairbanks            NaN     NaN                          0.7756
      Juneau               NaN     NaN                          0.7167
      Palmer               NaN     NaN                          0.3333
...                        ...     ...                             ...
WY    Powell               NaN     NaN                             NaN
      Riverton             NaN     NaN                             NaN
      Rock Springs         NaN     NaN                             NaN
      Sheridan             NaN     NaN                             NaN
      Torrington           NaN     NaN                             NaN

[2923 rows x 3 columns]

In [26]:
# Question 3
# Return to the summary of state scores from first step...
# Which state has the highest average four year retention rate (full_time_retention_rate_4_year)? 
# Which has the lowest average?
summary_full_time.head()
summary_full_time['Average'].idxmin()

'CO'

<div class="alert alert-block alert-warning">
<h3> Important Notes</h3>
<p> </p> 
When producing any of the summary statistics using group by, you can assign your intermediate operations to the variables. In the entire section above, I have been mostly trying to produce the results to show them to you. However, you can assign the results to a variable for using it in the future. **See the example below.** 
</div>

In [ ]:
flights_by_airline_month = flights.groupby(['AIRLINE', 'MONTH'])
aggregation = {
                'DISTANCE': [np.min, np.max], 
                 'TAXI_IN': np.mean
              }
column_names = { 'amin': "Minimum", 'amax': 'Maximum', 'mean': 'Average' }

summary_distance_taxi_in = flights_by_airline_month.aggregate(
    aggregation
    ).rename( columns=column_names )

In [ ]:
summary_distance_taxi_in.head()

In [ ]:
# Remember from the last class that we can do aggregations at multiple levels using Hierarchical index. 
summary_distance_taxi_in.mean(level='AIRLINE')

In [ ]:
summary_distance_taxi_in.mean(level='MONTH')